defmodule MarkevichMoney.Pipelines.Help.Callbacks do
  use MarkevichMoney.Constants
  alias MarkevichMoney.CallbackData
  alias MarkevichMoney.Pipelines.Help.Messages, as: HelpPipeline
  alias MarkevichMoney.Steps.Telegram.{SendMessage, SendPhoto}

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_newby}
        } = callback_data
      ) do
    payload = callback_data |> Map.from_struct()

    message = """
    `> 🤔 Я новенький, помогите разобраться!`

    После каждого списания с карточки, подключенной к системе “Альфа-Клик”, в бот будет приходить уведомление о транзакции подобного вида:
    """

    payload
    |> Map.put(:output_message, message)
    |> SendMessage.call()

    payload
    |> Map.put(:output_file_id, get_file_id(:newby_transaction_example))
    |> SendPhoto.call()

    message = """
    Бот старается сам определять категорию транзакции, но поначалу он может ошибиться или не указать категорию вовсе. Тут ему понадобится твоя помощь: нажми на кнопку `Категория` и самостоятельно выбери категорию, к которой относится твоя трата.

    В следующий раз бот уже будет знать, какую категорию ему выбрать. Помощь нужна боту только в самом начале работы: через несколько недель он начнёт автоматически присваивать категории всем твоим тратам, и выбирать категорию вручную нужно будет только изредка, в незнакомых для бота ситуациях.

    Если хочешь, чтобы бот не учитывал какую-то трату, то нажми кнопку `Удалить` под уведомлением о транзакции. *Само уведомление при этом удалять не надо!*

    Кнопки поменяются на `❌Удалить❌` и `Отмена`. Если точно хочешь удалить трату, жми на первую кнопку; если всё-таки передумаешь, то жми на вторую. После удаления транзакции на месте уведомления появится слово `Удалено`.

    Для того, чтобы вызвать диалог помощи, напиши /help.

    В любой момент времени у бота можно запросить статистику по своим тратам за определённый период времени. Подробнее об этом написано в разделе помощи `"Как посмотреть статистику?"`.

    Бот может учесть даже траты, сделанные наличкой или другими карточками, если ты ему в этом немного поможешь. О том, как добавить транзакции вручную написано в разделе `"Как добавить трату вручную?"`.

    Чувствуешь, что тратишь слишком много денег на что-то одно? Ты можешь установить лимит трат на определённую категорию, а бот будет периодически тебе о нём напоминать. Научиться выставлять лимиты можно при помощи раздела `"Работа с лимитами."`.


    Сейчас я специально вызову команду /help, для того, чтобы показать, как выглядит диалог помощи.
    """

    payload
    |> Map.put(:output_message, message)
    |> SendMessage.call()

    payload
    |> HelpPipeline.call()
  end

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_add}
        } = callback_data
      ) do
    message = """
    `> 📲 Как добавить трату вручную?`

    Бот обучен автоматически создавать и распознавать транзакции по твоей карточке, подключенной к системе “Альфа-Клик”. Однако не редки случаи, когда тебе необходимо расплатиться наличкой или картой другого банка. Что делать в такой ситуации, чтобы не потерять информацию о своих тратах?

    Ты можешь добавлять в бота любую транзакцию вручную с помощью специальной команды `/add x y`, где:

    `x` - сумма траты в белорусских рублях, например: `10`, `45.5`;

    `y` - описание траты, например: `Фрукты на рынке`, `Такси наличкой`.

    Таким образом, если ты купил на рынке фруктов на 10.5 белорусских рублей и расплатился за них наличкой, то команда по добавлению новой транзакции в бота будет выглядеть так:

    `/add 10.5 фрукты на рынке`.

    При помощи данной функции ты можешь сохранять информацию о всех совершенных тобой покупках и иметь полное представление о своих ежемесячных затратах, не опираясь только на информацию о транзакциях по карточке.
    """

    callback_data
    |> Map.from_struct()
    |> Map.put(:output_message, message)
    |> SendMessage.call()
  end

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_stats}
        } = callback_data
      ) do
    message = """
    `> 📈 Как посмотреть статистику?`

    Бот автоматически ведёт статистику всех твоих трат в фоновом режиме. Таким образом, ты можешь посмотреть, сколько денег было потрачено за конкретный период времени. Для этого необходимо ввести в строку команду /stats.

    Здесь ты можешь выбрать конкретный период времени для отображения статистики (неделя, месяц, квартал и т.д.), изучить свои траты и проанализировать их по категориям. Также в статистике можно увидеть, не вышел ли ты за установленные лимиты, а на какие категории трат стоит обратить особое внимание.

    На что ты больше всего тратил в минувшем месяце? На еду или на одежду? На семью или на машину? Не слишком ли ты много тратишь на развлечения? А может быть... Мало? И надо больше баловать себя простыми радостями жизни?

    Всю эту информацию ты узнаешь из раздела `Статистика`.
    """

    callback_data
    |> Map.from_struct()
    |> Map.put(:output_message, message)
    |> SendMessage.call()
  end

  def call(
        %CallbackData{
          callback_data: %{
            "pipeline" => @help_callback,
            "type" => @help_callback_edit_description
          }
        } = callback_data
      ) do
    payload = callback_data |> Map.from_struct()

    message = """
    `> 📝 Как добавить описание транзакции?`

    К каждой транзакции можно добавить комментарий, который отобразится в пункте «Описание» и в статистике по установленной категории. Для этого нужно ответить на сообщение бота с той транзакцией, которая тебя интересует. Напиши в ответе любой комментарий и отправь боту — тебе тут же придёт новая версия сообщения о транзакции. Так это выглядит в десктоп-версии Телеграма:
    """

    payload
    |> Map.put(:output_message, message)
    |> SendMessage.call()

    payload
    |> Map.put(:output_file_id, get_file_id(:edit_description_example))
    |> SendPhoto.call()

    message = """
    Если захочешь исправить описание, то сможешь сделать это в любой момент тем же способом, что описан выше!

    Комментарий можно добавить только к сообщению о транзакции. Если попытаться ответить на любое другое сообщение бота, то ты увидишь следующее предупреждение: `Что-то пошло не так, бот не смог распознать твой ответ. Возможно, ответ был отправлен не на сообщение с транзакцией.`.
    """

    payload
    |> Map.put(:output_message, message)
    |> SendMessage.call()

    payload
    |> HelpPipeline.call()
  end

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_limits}
        } = callback_data
      ) do
    message = """
    `> ✋ Работа с лимитами.`

    Бот готов стать твоим голосом разума, который будет следить за тратами и осуждающе оповещать об излишнем транжирстве. Для этих целей в него внедрена функция "Лимитов".

    "Лимиты" – это лёгкий и удобный инструмент, позволяющий тебе держать руку на пульсе ежемесячных затрат. Установив лимит на конкретную категорию транзакций, ты будешь получать оповещения каждый раз, когда твои траты будут превышать `50%`, `70%`, `90%`, а потом уже и `100%` от установленного значения. Таким образом, ты можешь отслеживать свои траты в течение месяца и всегда будешь заранее знать о приближении конкретных лимитов.

    Ты можешь устанавливать лимиты на любую категорию вручную с помощью специальной команды `/set_limit x y`, где:
    `x` – название категории: `Развлечения`, `Продукты`;
    `y` – сумма, которую ты готов тратить на эту категорию в месяц: `50` , `100`, `250`. Число `0` - отсутствие лимита.

    Разберём пару примеров:
    Представим, что ты решил слегка сократить количество тусовок в своей жизни и установил лимит в 500 белорусских рублей на категорию "Развлечения": `/set_limit развлечения 500`.

    Кейс №1:
    Сегодня 15-ое число месяца, твоя сумма трат по данной категории достигла 250 белорусских рублей.
    Бот присылает тебе сообщение следующего вида: `"Внимание! В категории "Развлечения" потрачено 50% месячного бюджета"` . Ты знаешь, что сейчас уже где-то середина месяца. При этом ты потратил ровно 50% бюджета – значит, ты всё делаешь правильно, особо не перебираешь с развлечениями, но при этом и не ограничиваешься себя совсем. В общем, волноваться не о чем!

    Кейс №2:
    Сегодня 6-ое число месяца, а сумма твоих трат уже достигла 250 рублей.
    Ты получишь аналогичное сообщение о превышении 50% порога. Возможно, ты неплохо провёл время, и приятные воспоминания надолго останутся с тобой. Но, надо помнить, что впереди ещё целый месяц, а ты уже потратил половину планируемых средств! Стоит уменьшить траты на развлечения и держать себя в руках. Если ты, конечно, не хочешь, чтобы на тебя начал ругаться бот.

    Для того, чтобы посмотреть установленные лимиты и статистику текущих трат по лимитам, воспользуйся командой /limits.
    """

    callback_data
    |> Map.from_struct()
    |> Map.put(:output_message, message)
    |> SendMessage.call()
  end

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_support}
        } = callback_data
      ) do
    message = """
    `> 🆘 Поддержка.`

    По всем возникающим вопросам и предложения, ты можешь обращаться в чат поддержки [https://t.me/markevich_support].
    """

    callback_data
    |> Map.from_struct()
    |> Map.put(:output_message, message)
    |> SendMessage.call()
  end

  def call(
        %CallbackData{
          callback_data: %{"pipeline" => @help_callback, "type" => @help_callback_bug}
        } = callback_data
      ) do
    message = """
    `> 🐞 Сообщить об ошибке.`

    Если ты нашел какую-то ошибку в работе бота или у тебя не работают (полностью или частично) отдельные функции - всегда можешь обратиться в чат поддержки [https://t.me/markevich_support].
    """

    callback_data
    |> Map.from_struct()
    |> Map.put(:output_message, message)
    |> SendMessage.call()
  end

  defp get_file_id(picture_name) do
    Application.get_env(:markevich_money, :tg_file_ids)[:help][picture_name]
  end
end
